app/controllers/recetas_controller.rb

  def index
    @recetas = Receta.find(:all,:conditions => condicion_basica)
---
SELECT * FROM `recetas` WHERE (usuario = 1)

  def show
    @receta = Receta.find(params[:id])
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)

  def edit
    @receta = Receta.find(params[:id])
    @etiquetaings=Etiquetaing.find(:all,:conditions => condicion_basica)
    @ingredientes_excluidos = Ingrediente.find(:all,:conditions => condicion_basica);
    @ingredientes_incluidos = Ingredientesreceta.find(:all,:conditions => "receta = "+@receta.id.to_s);
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `etiquetaings` WHERE (usuario = 1)
SELECT * FROM `ingredientes` WHERE (`ingredientes`.`id` = 3)
SELECT * FROM `ingredientesrecetas` WHERE (receta = 1)

  def create
    @receta = Receta.new(params[:receta])
    @receta.usuario = usuario_actual
    respond_to do |format|
      if @receta.save
---
INSERT INTO `recetas` (`created_at`, `nombre`, `updated_at`, `usuario`) VALUES('2012-01-09 11:18:44', 'Polo con patatas', '2012-01-09 11:18:44', 1)

  def anadir_ingredientes

    pp=params[:nuevos_ingredientes]

    ingredientes=Ingrediente.find(:all,:conditions => condicion_basica)

    receta=Receta.find(pp[:receta].to_i)

    for ingrediente in ingredientes do
      selected=eval("pp[:select_"+ingrediente.id.to_s+"]").to_i
      if selected == 1  then
        unidad=eval("pp[:unidad_"+ingrediente.id.to_s+"]").to_i
        i=Unidadmedidaingrediente.find(:first,:conditions => "ingrediente = "+ingrediente.id.to_s+" and unidadmedida = "+unidad.to_s)

        puts("Located "+i.id.to_s+"Ingrediente: "+selected.to_s + " Unidad: "+unidad.to_s)

        nuevo_ingrediente = Ingredientesreceta.new
        nuevo_ingrediente.receta=receta.id
        nuevo_ingrediente.ingrediente=i.id
        nuevo_ingrediente.cantidad = eval("pp[:cantidad_"+ingrediente.id.to_s+"]").to_f
        if nuevo_ingrediente.cantidad>0 then nuevo_ingrediente.save end
        puts("Saved "+i.id.to_s)

      end
    end

    receta.agrupar

    etiquetaings=Etiquetaing.find(:all,:conditions => condicion_basica)
    ingredientes_incluidos = Ingredientesreceta.find(:all,:conditions => "receta = "+receta.id.to_s);
---
SELECT * FROM `ingredientes` WHERE (`ingredientes`.`id` = 3)
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `unidadmedidaingredientes` WHERE (ingrediente = 3 and unidadmedida = 1) LIMIT 1
INSERT INTO `ingredientesrecetas` (`ingrediente`, `created_at`, `updated_at`, `receta`, `cantidad`) VALUES(1, '2012-01-09 11:29:32', '2012-01-09 11:29:32', 1, 2.0)
SELECT * FROM `etiquetaings` WHERE (usuario = 1)
SELECT * FROM `ingredientesrecetas` WHERE (receta = 1 AND ingrediente = 1)

  def guardar_platos

    pp=params[:plato]
    receta=Receta.find(pp[:receta].to_i)

    platos=Plato.find(:all)

    for plato in platos do

      estado=eval("pp[:select_"+plato.id.to_s+"]").to_i
      puts("pp[:select_"+plato.id.to_s+"] = "+estado.to_s)

      nombre=eval("pp[:nombre_"+plato.id.to_s+"]").to_s
      if (plato.nombre != nombre )
        plato.nombre=nombre
        plato.save
      end


      if estado == 1
        platoreceta=Platoreceta.find(:first,:conditions => "plato = "+plato.id.to_s+" and receta = "+receta.id.to_s)
        if platoreceta == nil then
          platoreceta=Platoreceta.new
          platoreceta.receta=receta.id
          platoreceta.plato=plato.id
          platoreceta.save
        end
      else
        platoreceta=Platoreceta.find(:first,:conditions => "plato = "+plato.id.to_s+" and receta = "+receta.id.to_s)
        if platoreceta != nil then
          platoreceta.destroy
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `platos` WHERE (usuario = 1)
SELECT `platorecetas`.id FROM `platorecetas` WHERE (`platorecetas`.`receta` = 1 AND `platorecetas`.plato = 1) LIMIT 1
INSERT INTO `platorecetas` (`created_at`, `plato`, `updated_at`, `receta`) VALUES('2012-01-09 12:28:25', 1, '2012-01-09 12:28:25', 1)
DELETE FROM `platorecetas` WHERE `id` = 2

  def guardar_etiquetas

    pp=params[:etiqueta]
    receta=Receta.find(pp[:receta].to_i)

    etiquetas=Etiqueta.find(:all,:conditions => condicion_basica)

    for etiqueta in etiquetas do

      estado=eval("pp[:select_"+etiqueta.id.to_s+"]").to_i
      puts("pp[:select_"+etiqueta.id.to_s+"] = "+estado.to_s)

      nombre=eval("pp[:nombre_"+etiqueta.id.to_s+"]").to_s
      if (etiqueta.nombre != nombre )
        etiqueta.nombre=nombre
        etiqueta.save
      end

      if estado == 1
        etiquetareceta=Etiquetareceta.find(:first,:conditions => "etiqueta = "+etiqueta.id.to_s+" and receta = "+receta.id.to_s)
        if etiquetareceta == nil then
          etiquetareceta=Etiquetareceta.new
          etiquetareceta.receta=receta.id
          etiquetareceta.etiqueta=etiqueta.id
          etiquetareceta.save
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `etiquetas` WHERE (usuario = 1)
SELECT `etiquetarecetas`.id FROM `etiquetarecetas` WHERE (`etiquetarecetas`.`etiqueta` = 1 AND `etiquetarecetas`.receta = 1) LIMIT 1
INSERT INTO `etiquetarecetas` (`created_at`, `etiqueta`, `updated_at`, `usuario`, `receta`) VALUES('2012-01-09 12:27:53', 1, '2012-01-09 12:27:53', NULL, 1)

  def crear_etiqueta

    pp=params[:nueva_etiqueta]
    receta=Receta.find(pp[:receta].to_i)

    etiqueta=Etiqueta.new
    etiqueta.usuario = usuario_actual
    etiqueta.nombre= pp[:nombre]
    etiqueta.save

    etiquetas = Etiqueta.find(:all,:conditions => condicion_basica)
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
INSERT INTO `etiquetas` (`created_at`, `nombre`, `updated_at`, `usuario`) VALUES('2012-01-09 11:20:49', 'comida sana', '2012-01-09 11:20:49', 1)
SELECT * FROM `etiquetas` WHERE (usuario = 1)

  def crear_plato

    pp=params[:nuevo_plato]
    receta=Receta.find(pp[:receta].to_i)

    plato=Plato.new
    plato.usuario = usuario_actual
    plato.nombre= pp[:nombre]
    plato.save

    platos=Plato.find(:all,:conditions => condicion_basica)
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
INSERT INTO `platos` (`created_at`, `nombre`, `updated_at`, `usuario`) VALUES('2012-01-09 11:21:27', 'Comida', '2012-01-09 11:21:27', 1)
SELECT * FROM `platos` WHERE (usuario = 1)

  def crear_ingrediente
    pp=params[:nuevo_ingrediente]
    receta=Receta.find(pp[:receta].to_i)

    ingrediente=Ingrediente.new
    ingrediente.nombre=pp[:nombre]
    ingrediente.usuario = usuario_actual
    ingrediente.save

    ingredientes_excluidos = Ingrediente.find(:all,:conditions => condicion_basica);
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
INSERT INTO `ingredientes` (`tipo`, `created_at`, `nombre`, `updated_at`, `unidadmedia`, `usuario`) VALUES(NULL, '2012-01-09 11:19:03', 'pollo', '2012-01-09 11:19:03', NULL, 1)
SELECT * FROM `ingredientes` WHERE (usuario = 1)

  def borrar_ingrediente
    ingrediente=Ingrediente.find(params[:ingrediente])
    receta=Receta.find(params[:receta].to_i)

    ingrediente.destroy
---
SELECT * FROM `ingredientes` WHERE (`ingredientes`.`id` = 2)
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
DELETE FROM `ingredientes` WHERE `id` = 2

  def editar_ingrediente
    receta=Receta.find(params[:receta].to_i)
    ingrediente=Ingrediente.find(params[:ingrediente].to_i)

    unidadesmedida = Unidadmedida.find(:all)
    etiquetaings = Etiquetaing.find(:all,:conditions => condicion_basica)

    ingredientes_incluidos = Ingredientesreceta.find(:all,:conditions => "receta = "+receta.id.to_s);
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `ingredientes` WHERE (`ingredientes`.`id` = 1)
SELECT * FROM `etiquetaings` WHERE (usuario = 1)
SELECT * FROM `ingredientesrecetas` WHERE (ingrediente = 3)

  def cancelar_fusionar_etiqueta
    receta=Receta.find(params[:receta].to_i)

    etiquetas = Etiqueta.find(:all,:conditions => condicion_basica)
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `etiquetas` WHERE (usuario = 1)

  def cancelar_fusionar_plato
    receta=Receta.find(params[:receta].to_i)

    platos=Plato.find(:all,:conditions => condicion_basica)
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `platos` WHERE (usuario = 1)

  def cancelar_editar_ingrediente
    receta=Receta.find(params[:receta].to_i)

    etiquetaings=Etiquetaing.find(:all,:conditions => condicion_basica)
    ingredientes_incluidos = Ingredientesreceta.find(:all,:conditions => "receta = "+receta.id.to_s);
    ingredientes_excluidos = Ingrediente.find(:all,:conditions => condicion_basica);
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `etiquetaings` WHERE (usuario = 1)
SELECT * FROM `ingredientesrecetas` WHERE (ingrediente = 1)
SELECT * FROM `ingredientes` WHERE (`ingredientes`.`id` = 3)

  def mostrar_receta
    receta=Receta.find(params[:receta].to_i)

    ingredientes_incluidos = Ingredientesreceta.find(:all,:conditions => "receta = "+receta.id.to_s);
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `ingredientesrecetas` WHERE (receta = 1)

  def mostrar_ficha
    receta=Receta.find(params[:receta].to_i)

    ingredientes_incluidos = Ingredientesreceta.find(:all,:conditions => "receta = "+receta.id.to_s);
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `ingredientesrecetas` WHERE (receta = 1)

  def update_ingrediente

    pp=params[:ingrediente]
    receta=Receta.find(pp[:receta].to_i)
    ingrediente=Ingrediente.find(pp[:id])

    unidades=Unidadmedida.find(:all,:conditions => condicion_basica)

    ingrediente.nombre=pp[:nombre]
    ingrediente.tipo=pp[:tipo]

    ingrediente.save

    for unidad in unidades do

      estado=eval("pp[:select_"+unidad.id.to_s+"]").to_i
      puts("pp[:select_"+unidad.id.to_s+"] = "+estado.to_s)

      if estado == 1
        unidadmedidaingrediente=Unidadmedidaingrediente.find(:first,:conditions => "ingrediente = "+ingrediente.id.to_s+" and unidadmedida = "+unidad.id.to_s)
        if unidadmedidaingrediente == nil then
          unidadmedidaingrediente=Unidadmedidaingrediente.new
          unidadmedidaingrediente.ingrediente=ingrediente.id
          unidadmedidaingrediente.unidadmedida=unidad.id
          unidadmedidaingrediente.save
        end
      else
        unidadmedidaingrediente=Unidadmedidaingrediente.find(:first,:conditions => "ingrediente = "+ingrediente.id.to_s+" and unidadmedida = "+unidad.id.to_s)
        if unidadmedidaingrediente != nil then
          unidadmedidaingrediente.destroy
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `ingredientes` WHERE (`ingredientes`.`id` = 3)
SELECT * FROM `unidadmedidas` WHERE (`unidadmedidas`.`id` = 1)
SELECT `ingredientes`.id FROM `ingredientes` WHERE (`ingredientes`.`nombre` = BINARY 'Pollo' AND `ingredientes`.usuario = 1 AND `ingredientes`.id <> 3) LIMIT 1
SELECT `unidadmedidaingredientes`.id FROM `unidadmedidaingredientes` WHERE (`unidadmedidaingredientes`.`ingrediente` = 3 AND `unidadmedidaingredientes`.unidadmedida = 1) LIMIT 1
INSERT INTO `unidadmedidaingredientes` (`ingrediente`, `created_at`, `updated_at`, `unidadmedida`) VALUES(3, '2012-01-09 11:27:53', '2012-01-09 11:27:53', 1)
DELETE FROM `unidadmedidaingredientes` WHERE `id` = 3

      end
    end

    etiquetaings=Etiquetaing.find(:all,:conditions => condicion_basica)
---
SELECT * FROM `etiquetaings` WHERE (usuario = 1)



    etiquetaings=Etiquetaing.find(:all,:conditions => condicion_basica)
    ingredientes_incluidos = Ingredientesreceta.find(:all,:conditions => "receta = "+receta.id.to_s);
---
SELECT * FROM `ingredientesrecetas` WHERE (ingrediente = 1)

  def crear_unidad
    pp=params[:nueva_unidad]
    receta=Receta.find(pp[:receta].to_i)
    ingrediente=Ingrediente.find(pp[:ingrediente])

    unidad=Unidadmedida.new
    unidad.nombre=pp[:nombre]
    unidad.usuario = usuario_actual
    unidad.save

    unidades=Unidadmedida.find(:all,:conditions => condicion_basica)
    etiquetaings=Etiquetaing.find(:all,:conditions => condicion_basica)
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `ingredientes` WHERE (`ingredientes`.`id` = 1)
INSERT INTO `unidadmedidas` (`created_at`, `nombre`, `updated_at`, `usuario`) VALUES('2012-01-09 11:19:19', 'Ud.', '2012-01-09 11:19:19', 1)
SELECT * FROM `unidadmedidas` WHERE (usuario = 1)
SELECT * FROM `etiquetaings` WHERE (usuario = 1)

  def cambiar_filtro_ingredientes
    receta=Receta.find(params[:receta].to_i)
    filtro_nombre=params[:filtro_nombre]
    filtro_tipo=params[:filtro_tipo].to_i
    condicion_especial = " AND nombre like '%"+filtro_nombre.to_s+"%'"
    if filtro_tipo > 0
      condicion_especial+=" AND tipo = '"+filtro_tipo.to_s+"'"
    end
    ingredientes_excluidos = Ingrediente.find(:all,:conditions => condicion_basica + condicion_especial);
---
SELECT * FROM `recetas` WHERE (`recetas`.`id` = 1)
SELECT * FROM `ingredientes` WHERE (usuario = 1 AND nombre like '%po%')